In [1]:
import numpy as np
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn import metrics
from sklearn import preprocessing
df = pd.read_table('train.csv',
                   sep=',',
                  header=0)
# Output printing out first 5 columns
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
# Lable male as 0, female as 1
df['Sex'] = df.Sex.map({'male':0, 'female':1})
print(df.shape)
df.head() # returns (rows, columns)

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df_f = df.loc[:, ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare']]
print(df_f.shape)
df_f.head()

X = df_f.values[:,:]
X = np.nan_to_num(X)
X.shape

(891, 6)

(891, 6)

In [4]:
Y = df.loc[:, ['Survived']]
Y = np.nan_to_num(Y)
Y.shape

(891, 1)

In [5]:
Y = Y.squeeze()
Y.shape

(891,)

In [6]:
X_scaled = preprocessing.scale(X)
X_scaled

array([[ 0.82737724, -0.73769513, -0.10231279,  0.43279337, -0.47367361,
        -0.50244517],
       [-1.56610693,  1.35557354,  0.80749164,  0.43279337, -0.47367361,
         0.78684529],
       [ 0.82737724,  1.35557354,  0.12513832, -0.4745452 , -0.47367361,
        -0.48885426],
       ...,
       [ 0.82737724,  1.35557354, -1.35329389,  0.43279337,  2.00893337,
        -0.17626324],
       [-1.56610693, -0.73769513,  0.12513832, -0.4745452 , -0.47367361,
        -0.04438104],
       [ 0.82737724, -0.73769513,  0.46631498, -0.4745452 , -0.47367361,
        -0.49237783]])

In [7]:
logreg = LogisticRegression()
logreg.fit(X_scaled, Y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [8]:
print(logreg.intercept_, logreg.coef_)

[-0.63103281] [[-0.81333962  1.29843082 -0.30125557 -0.3180572  -0.04601896  0.15407673]]

In [9]:
df_t = pd.read_table('test.csv',
                   sep=',',
                  header=0)
# Output printing out first 5 columns
df_t.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [10]:
df_tf = df_t.loc[:, ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare']]
df_tf['Sex'] = df_tf.Sex.map({'male':0, 'female':1})
print(df_tf.shape)
df_tf.head()

(418, 6)

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    0  34.5      0      0   7.8292
1       3    1  47.0      1      0   7.0000
2       2    0  62.0      0      0   9.6875
3       3    0  27.0      0      0   8.6625
4       3    1  22.0      1      1  12.2875

In [11]:
#X_t_scaled = preprocessing.scale(X_T)

X_T = df_tf.values[:,:]
X_T = np.nan_to_num(X_T)
X_T.shape


X_t_scaled = preprocessing.scale(X_T)
X_t_scaled

array([[ 0.87348191, -0.75592895,  0.59480137, -0.49947002, -0.4002477 ,
        -0.49663711],
       [ 0.87348191,  1.32287566,  1.30589556,  0.61699237, -0.4002477 ,
        -0.5114971 ],
       [-0.31581919, -0.75592895,  2.15920859, -0.49947002, -0.4002477 ,
        -0.46333473],
       ...,
       [ 0.87348191, -0.75592895,  0.82235151, -0.49947002, -0.4002477 ,
        -0.50701688],
       [ 0.87348191, -0.75592895, -1.3678186 , -0.49947002, -0.4002477 ,
        -0.49268018],
       [ 0.87348191, -0.75592895, -1.3678186 ,  0.61699237,  0.61989583,
        -0.23626278]])

In [12]:
#logreg.predict(X_t_scaled)
df_y = pd.read_table('gender_submission.csv',
                   sep=',',
                  header=0)
# Output printing out first 5 columns
df_y.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [13]:
y_t = df_y.loc[:, ['Survived']]
y_t = y_t.squeeze()
y_t.shape

(418,)

In [14]:
 logreg.predict(X_t_scaled)

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0,
       1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1,
       0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1,
       0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0,
       1, 0, 0, 0], dtype=int64)

In [15]:
accuracy_score = logreg.score(X_t_scaled, y_t)
print(accuracy_score)

0.961722488038